Repository: NaN-tic/trytond-product_raw_variant
Catalog: locale/*.po
Languages: ca_es, es_es

# error:product.product-product.raw_product:
source: The Main Variant must be unique.
ca_es: La variant principal ha de ser única.
es_es: La variante principal debe ser única.

# error:product.product-product.raw_product:
source: The Raw Variant must be unique.
ca_es: La variant sense processar ha de ser única.
es_es: La variante sin procesar debe ser única.

# error:product.product:
source: Delete raw variants is forbidden. You are trying to delete the variant "%(raw_product)s" but it is defined as Raw Variant for product "%(product)s".
ca_es: Está prohibit eliminar variants sense processar. Està intentant eliminar la variant "%(raw_product)s" però està definida com a Variant sense processar pel producte "%(product)s".
es_es: Está prohibido eliminar variantes sin procesar. Está intentando eliminar la variante "%(raw_product)s" pero está definida como Variante sin procesar para el producto "%(product)s".

# error:product.product:
source: The Variant "%s" has a Main Variant but it isn't configured as "Is Raw Variant", which doesn't make sense.
ca_es: La variant "%s" té una variant principal però no està configurat com a "Es variant sense processar", cosa que no té sentit.
es_es: La variante "%s" tiene una variante principal, pero no esta configurado cómo que "Tiene variantes sin procesar", cosa que no tiene sentido.

# error:product.product:
source: The Variant "%s" has a Raw Variant but it is configured as "Is Raw Variant", which doesn't make sense.
ca_es: La variant "%s" té una variant sense processar però no està configurat com a "Es variant sense processar", cosa que no té sentit.
es_es: La variante "%s" tiene una variante sin procesar, pero no esta configurado cómo que "Tiene variantes sin procesar", cosa que no tiene sentido.

# error:product.product:
source: The Variant "%s" has a Raw or Main Variant but its template doesn't have the mark "Has Raw Variants".
ca_es: La variant "%s" té una variant principal o sense processar però la seva plantilla no està marcada com a que "Té variants sense processar".
es_es: La variante "%s" tiene una variante principal o una variante sin procesar, pero su plantilla no tiene la marca de "Tiene variantes sin procesar"

# field:product.configuration,raw_product_prefix:
source: Raw variant prefix
ca_es: Prefix variant sense processar
es_es: Prefijo variantes sin procesar

# field:product.product,has_raw_products:
source: Has Raw Variants
ca_es: Té variants sense processar
es_es: Tiene variantes sin procesar

# field:product.product,is_raw_product:
source: Is Raw Variant
ca_es: És variant sense processar
es_es: Es variante sin procesar

# field:product.product,main_product:
source: Main Variant
ca_es: Variant principal
es_es: Variante principal

# field:product.product,raw_product:
source: Raw Variant
ca_es: Variant sense processar
es_es: Variante sin procesar

# field:product.product-product.raw_product,create_date:
source: Create Date
ca_es: Data creació
es_es: Fecha creación

# field:product.product-product.raw_product,create_uid:
source: Create User
ca_es: Usuari creació
es_es: Usuario creación

# field:product.product-product.raw_product,id:
source: ID
ca_es: Identificador
es_es: Identificador

# field:product.product-product.raw_product,product:
source: Main Variant
ca_es: Variant principal
es_es: Variante principal

# field:product.product-product.raw_product,raw_product:
source: Raw Variant
ca_es: Variant sense processar
es_es: Variante sin procesar

# field:product.product-product.raw_product,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:product.product-product.raw_product,write_date:
source: Write Date
ca_es: Data modificació
es_es: Fecha modificación

# field:product.product-product.raw_product,write_uid:
source: Write User
ca_es: Usuari modificació
es_es: Usuario modificación

# field:product.template,has_raw_products:
source: Has Raw Variants
ca_es: Té variants sense processar
es_es: Tiene variantes sin procesar

# field:product.template,main_products:
source: Main Variants
ca_es: Variants principal
es_es: Variantes principales

# field:product.template,raw_products:
source: Raw Variants
ca_es: Variants sense processar
es_es: Variantes sin procesar

# help:product.configuration,raw_product_prefix:
source: This prefix will be added to raw variant code
ca_es: Aquest prefix s'afegirà al codi de la variant sense processar
es_es: Se añadirá este prefijo al código de la variante sin procesar

# help:product.template,has_raw_products:
source: If you check this option, all variants must to have one and only one raw variant. The system will create it when a variant is created.
ca_es: Si es marca aquesta opció, totes les variants han de tenir una i nomes una variant sense processar. El sistema la crearà automàticament quan es crea la variant.
es_es: Si se marca esta opción, todas las variantes deberán tener una y solo una variante sin procesar. Els sistema la creará cuando se cree una variante.

# model:ir.action.act_window.domain,name:act_product_form_domain_all
source: All
ca_es: Tots
es_es: Todos

# model:ir.action.act_window.domain,name:act_product_form_domain_not_raw
source: Main Variants
ca_es: Variants principals
es_es: Variantes principales

# model:ir.action.act_window.domain,name:act_product_form_domain_raw
source: Raw Variants
ca_es: Variants sense processar

# model:product.product-product.raw_product,name:
source: Main Variant - Raw Variant
ca_es: Variant principal - Variant sense processar
es_es: Variante principal - Variante sin procesar

# view:product.configuration:
source: Raw variants configuration
ca_es: Configuració variants sense processar
es_es: Configuración variantes sin procesar

# model:ir.action.act_window.domain,name:act_product_form_domain_raw
source: Raw Products
es_es: Variantes sin procesar
